adding architecture.md
